In [1]:
import pandas as pd

In [2]:
from pandas import Series , DataFrame

In [3]:
obj = pd.Series([4,5,8,9,-5])

In [4]:
#auto pprovide index
obj

0    4
1    5
2    8
3    9
4   -5
dtype: int64

In [5]:
#we can see both
obj.values

array([ 4,  5,  8,  9, -5])

In [6]:
#like range 5
obj.index

RangeIndex(start=0, stop=5, step=1)

In [9]:
obj2 = pd.Series([4, 7, 5, 3], index = ['a','b','c','x'])

In [ ]:
#our own indexing

In [10]:
obj2

a    4
b    7
c    5
x    3
dtype: int64

In [ ]:
#we can also change the variable

In [12]:
obj2['x'] = 8

In [13]:
obj2

a    4
b    7
c    5
x    8
dtype: int64

In [14]:
obj2 * 5

a    20
b    35
c    25
x    40
dtype: int64

In [16]:
import numpy as np
np.exp(obj2)

a      54.598150
b    1096.633158
c     148.413159
x    2980.957987
dtype: float64

In [17]:
#like you check check the data in list
'e' in obj2

False

In [18]:
sdata = {'waqas': 35000,'ovaais': 3550,'wahid': 35540}

In [19]:
sdata

{'waqas': 35000, 'ovaais': 3550, 'wahid': 35540}

In [20]:
obj3 = pd.Series(sdata)








90

90

In [21]:
obj3

waqas     35000
ovaais     3550
wahid     35540
dtype: int64

#DATA FRAMES

In [22]:
#When you are only passing a dict, the index in the resulting Series will have the dict’s
#keys in sorted order. You can override this by passing the dict keys in the order you
#want them to appear in the resulting Series:

In [23]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [24]:
obj3 = pd.Series(sdata)

In [25]:
#no sequence matter
#see fields with value
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [34]:
states = ['California','Ohio','korangi','Pakistan']

In [35]:
obj4 = pd.Series(sdata, index = states)
#by doing this we are bound to make make a state as index

In [36]:
obj4

California        NaN
Ohio          35000.0
korangi           NaN
Pakistan          NaN
dtype: float64

In [37]:
#Nan means not a number or not found case

In [38]:
#we can also see as a .isnull (kon kon se null ha ye btao)
pd.isnull(obj4)

California     True
Ohio          False
korangi        True
Pakistan       True
dtype: bool

In [39]:
#three are nulls

In [40]:
pd.notnull(obj4)

California    False
Ohio           True
korangi       False
Pakistan      False
dtype: bool

In [41]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [42]:
obj3 + obj4

California        NaN
Ohio          70000.0
Oregon            NaN
Pakistan          NaN
Texas             NaN
Utah              NaN
korangi           NaN
dtype: float64

In [44]:
obj4.name = 'population'
obj4.index.name ='state'
obj4

state
California        NaN
Ohio          35000.0
korangi           NaN
Pakistan          NaN
Name: population, dtype: float64

In [46]:
#A Series’s index can be altered in-place by assignment:
obj

0    4
1    5
2    8
3    9
4   -5
dtype: int64

In [48]:
#now we are playing with indexing by doing such manupolation
obj.index =['bob','waqas','qasim','zahir','ali']

In [49]:
obj

bob      4
waqas    5
qasim    8
zahir    9
ali     -5
dtype: int64

In [51]:
#There are many ways to construct a DataFrame, though one of the most common is
#from a dict of equal-length lists or NumPy arrays:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
 'year': [2000, 2001, 2002, 2001, 2002, 2003],
 'pop': [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

In [52]:
#now we save this data frame as in frame variable
frame = pd.DataFrame(data)

In [53]:
#The resulting DataFrame will have its index assigned automatically as with Series, and
#the columns are placed in sorted order:
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [54]:
#If you specify a sequence of columns, the DataFrame’s columns will be arranged in
#that order:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [55]:
#If you pass a column that isn’t contained in the dict, it will appear with missing values
#in the result:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                      index=['one', 'two', 'three', 'four','five', 'six'])

In [57]:
#we are passing data and extra colomn to the new frame variable 



frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN
six    2003  Nevada  3.2  NaN

In [60]:
#now we can see every thing seperatily by using simple keywords

frame2.columns
#it shows all the colomns in one row

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [64]:
#pick one by one every colomns element
frame2['year']

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [63]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
six      Nevada
Name: state, dtype: object

In [65]:
frame2['pop']
#frame2[column] works for any column name, but frame2.column
#only works when the column name is a valid Python variable
#name.

one      1.5
two      1.7
three    3.6
four     2.4
five     2.9
six      3.2
Name: pop, dtype: float64

In [67]:
#also by calling a function
frame2.debt
#Attribute-like access (e.g., frame2.year) and tab completion of column names in IPython is provided as a convenience

one      NaN
two      NaN
three    NaN
four     NaN
five     NaN
six      NaN
Name: debt, dtype: object

In [68]:
#Rows can also be retrieved by position or name with the special loc attribute (much more on this later):
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [69]:
#Columns can be modified by assignment. For example, the empty 'debt' column
#could be assigned a scalar value or an array of values:
frame2['debt'] = 16.5

In [70]:
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  16.5

In [71]:
#now by calling method
frame2.debt['one','four','six'] = [10, 5, 25]

/home/waqas-bhambha/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

/home/waqas-bhambha/anaconda3/lib/python3.7/site-packages/pandas/core/indexing.py:190: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  self._setitem_with_indexer(indexer, value)

In [73]:
#smart by of assign the values
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  10.0
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4   5.0
five   2002  Nevada  2.9  16.5
six    2003  Nevada  3.2  25.0

In [74]:
#another seperate way of assigning is below
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'three', 'five'])

In [75]:
#now by passing val variabe in frame dataset
frame2['debt'] = val

In [76]:
#result
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6  -1.5
four   2001  Nevada  2.4   NaN
five   2002  Nevada  2.9  -1.7
six    2003  Nevada  3.2   NaN

In [77]:
#As an example of del, I first add a new column of boolean values where the state column equals 'Ohio':
frame2['eastern'] = frame2.state == 'Ohio'

In [78]:
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6  -1.5     True
four   2001  Nevada  2.4   NaN    False
five   2002  Nevada  2.9  -1.7    False
six    2003  Nevada  3.2   NaN    False

In [79]:
#New columns cannot be created with the frame2.eastern syntax.

In [81]:
#The del method can then be used to remove this column:
del frame2['eastern']

In [83]:
frame2.columns
#result with no eastern index

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [84]:
#Another common form of data is a nested dict of dicts:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [86]:
#now we making frame3 and asssign to pop
frame3 = pd.DataFrame(pop)

In [87]:
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [88]:
#You can transpose the DataFrame (swap rows and columns) with similar syntax to a NumPy array:
frame3.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [30]:
score = {'Python1':[74,72,78,79,74,84,85,81],
         'Python2':[71,72,78,79,84,82,64,67],
        'Ai-for-everyone':[94,92,98,85,81,87,75,68]}

In [31]:
piaic = pd.DataFrame(score)

In [32]:
piaic

   Python1  Python2  Ai-for-everyone
0       74       71               94
1       72       72               92
2       78       78               98
3       79       79               85
4       74       84               81
5       84       82               87
6       85       64               75
7       81       67               68

In [49]:
piaic['Name'] = ['Ali', 'Qasim', 'Ahmed','Zia khan', 'Waqas', 'Ibrahim', 'Mushtak','Faizan']

In [50]:
piaic['Total'] = piaic.Python1+piaic.Python2+piaic['Ai-for-everyone']
piaic['Percentage'] = ((piaic.Total/300.0)*100)
piaic['Aligible for Q2'] = piaic.Percentage > 80.0

In [65]:
pd.DataFrame(piaic,columns=['Name','Ai-for-everyone','Python1','Python2','Total','Percentage','Aligible for Q2'])

,Name,Ai-for-everyone,Python1,Python2,Total,Percentage,Aligible for Q2
0,Ali,94,74,71,239,79.666667,False
1,Qasim,92,72,72,236,78.666667,False
2,Ahmed,98,78,78,254,84.666667,True
3,Zia khan,85,79,79,243,81.000000,True
4,Waqas,81,74,84,239,79.666667,False
5,Ibrahim,87,84,82,253,84.333333,True
6,Mushtak,75,85,64,224,74.666667,False
7,Faizan,68,81,67,216,72.000000,False

In [5]:
#simple example to understand the senerio
import pandas as pd
from pandas import DataFrame
dsu = {
    'id':[1,2,3,4,5],
    'name':['waqas','ahmed','ali','usama','kamran'],
    'marks':[98,88,77,66,55]
}

In [6]:
dsusheet=pd.DataFrame(dsu)

In [8]:
dsusheet

   id    name  marks
0   1   waqas     98
1   2   ahmed     88
2   3     ali     77
3   4   usama     66
4   5  kamran     55

In [12]:
#search by index
dsusheet.loc[1]

id           2
name     ahmed
marks       88
Name: 1, dtype: object

In [13]:
#add colomn
dsusheet['rollno'] = [1221,1222,1223,1224,1225]

In [14]:
dsusheet

   id    name  marks  rollno
0   1   waqas     98    1221
1   2   ahmed     88    1222
2   3     ali     77    1223
3   4   usama     66    1224
4   5  kamran     55    1225

In [62]:
#we can rank all the list like this by ascending individual
dsusheet.rank(ascending=False, method='max')

    id  name  marks  rollno
0  5.0   1.0    1.0     5.0
1  4.0   5.0    2.0     4.0
2  3.0   4.0    3.0     3.0
3  2.0   2.0    4.0     2.0
4  1.0   3.0    5.0     1.0

In [63]:
#just for example how its work
dsusheet.sum()

id                              15
name      waqasahmedaliusamakamran
marks                          384
rollno                        6115
dtype: object